# Functions in Python

## Basics of Functions Definations

#### Simple Function defination

In [ ]:
def addition(x):

    return x[0]+x[1]


x = [3,4]

addition(x)

7

[0, 1, 2, 3, 4]

##### Define a function to create list with 5 rows and 3 columns

How to build a function :

In [ ]:

def array(rows, columns):
    
    list1 = []
    
    for i in range(rows):

        list2 = []

        for j in range(columns):

            list2.append(j)

        list1.append(list2)
        
    return list1



rows = 5
columns = 3
array(rows, columns)

[[0, 1, 2], [0, 1, 2], [0, 1, 2], [0, 1, 2], [0, 1, 2]]

#### Lambda Functions

How to write

In [ ]:
# On numerical

addition =  lambda x : x**2

4

In [ ]:
# On Strings

a = "mango,abc"

remove_spaces = lambda x : " ".join(x.split(","))

remove_spaces(a)

'mango abc'

In [ ]:
# Booleans

odd = lambda x : x%2 !=0

#### map

In [ ]:
a = [1,3,2,4]

dict(zip(list(map(lambda x : x, a)), list(map(lambda x : x%2 !=0, a))))

{1: True, 3: True, 2: False, 4: False}

In [ ]:
list(enumerate(a))

[(0, 1), (1, 3), (2, 2), (3, 4)]

#### Filter

In [ ]:
a = [1,2,3,4,5]

list(filter(lambda x : x%2 ==0, range(10)))

[0, 2, 4, 6, 8]

In [ ]:
a = [1,2,3,3,4,5]

list1 = []

for i in a: 
    
    if i not in list1:
        
        list1.append(i)
        
sum(list1)

15

In [ ]:
a = [1,2,3,4,3,4,5]

c = 0

for i in range(len(a)):
    
    for j in range(i+1, len(a)):
        
        if a[i] == a[j]:
            
            c+=1
            
            print(a[i])
            
    if c!=0:
        
        break

3

#### On Dataframes

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('C:\Sulochan\Tasks\PTDA_15\Tableau\Tableau_Evaluations\Tableau_Evaluation-2\Dataset/olympics_medals_country_wise_details.csv')

In [ ]:
df.columns

Index(['countries ', 'ioc_code ', 'summer_participations', 'summer_gold',
       'summer_silver', 'summer_bronze', 'winter_participations',
       'winter_gold', 'winter_silver', 'winter_bronze '],
      dtype='object')

In [ ]:
list(map(lambda x: x.split()[0], df.columns))

['countries',
 'ioc_code',
 'summer_participations',
 'summer_gold',
 'summer_silver',
 'summer_bronze',
 'winter_participations',
 'winter_gold',
 'winter_silver',
 'winter_bronze']

In [ ]:
df.columns = list(map(lambda x: x.split()[0], df.columns))

##### Using Functions on Dataframes

##### apply function

In [ ]:
df

,countries,ioc_code,summer_participations,summer_gold,summer_silver,summer_bronze,winter_participations,winter_gold,winter_silver,winter_bronze
0,Afghanistan,(AFG),15,0,0,2,0,0,0,0
1,Algeria,(ALG),14,5,4,8,3,0,0,0
2,Argentina,(ARG),25,21,26,30,20,0,0,0
3,Armenia,(ARM),7,2,8,8,8,0,0,0
4,Australasia,(ANZ),2,3,4,5,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...
151,Zambia,(ZAM),14,0,1,1,0,0,0,0
152,Zimbabwe,(ZIM),14,3,4,1,1,0,0,0
153,Independent Olympic Athletes,(IOA),3,1,0,1,0,0,0,0
154,Independent Olympic Participants,(IOP),1,0,1,2,0,0,0,0
155,Mixed Team,(ZZX),3,11,6,8,0,0,0,0

###### axis = 0

In [ ]:
df.loc[rows, columns]

In [ ]:
# display countries with names starting with A

df.loc[df['countries'].apply(lambda x: x[0].lower() == "a"), :]

,countries,ioc_code,summer_participations,summer_gold,summer_silver,summer_bronze,winter_participations,winter_gold,winter_silver,winter_bronze
0,Afghanistan,(AFG),15,0,0,2,0,0,0,0
1,Algeria,(ALG),14,5,4,8,3,0,0,0
2,Argentina,(ARG),25,21,26,30,20,0,0,0
3,Armenia,(ARM),7,2,8,8,8,0,0,0
4,Australasia,(ANZ),2,3,4,5,0,0,0,0
5,Australia,(AUS),27,164,173,210,20,6,7,6
6,Austria,(AUT),28,20,35,41,24,71,88,91
7,Azerbaijan,(AZE),7,7,14,28,7,0,0,0

In [ ]:
df.iloc[10:20, 2:4]

    summer_participations summer_gold
10                     13           0
11                      7          13
12                     27          44
13                     19           1
14                      3           0
15                     11           0
16                     23          37
17                      1           0
18                     21          54
19                     10           0

###### axis = 1

In [ ]:
#[countries, ioc_code,.....]

def Flag(x):
    
    return x[2]!=0 and x[6]!=0

df['Flag'] = df.apply(Flag, axis =1)

In [ ]:
df.apply(lambda x:x[2]!=0 and x[6]!=0, axis = 1)

0      False
1       True
2       True
3       True
4      False
       ...
151    False
152     True
153    False
154    False
155    False
Length: 156, dtype: bool

###### In Loc